Junior Year/January 2019/Assignment 5/Task 13/TUT12/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1000
(
(1.00025 0.000332433 0)
(0.999919 -1.92002e-006 3.31481e-027)
(0.999924 -2.84511e-006 0)
(0.999929 -3.28899e-006 0)
(0.999936 -3.32641e-006 0)
(0.999941 -3.09061e-006 0)
(0.999947 -2.71258e-006 0)
(0.999951 -2.29118e-006 3.31614e-027)
...
)
;

boundaryField
{
    walls
    {
        type            movingWallVelocity;
        value           uniform (1 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            outletInlet;
        outletValue     uniform (1 0 0);
        value           uniform (1 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
