Junior Year/January 2019/Assignment 5/Task 13/TUT12/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1890
(
0.000100095
-9.99978e-008
0.000100195
-1.00003e-007
0.000100295
-1.00008e-007
0.000100395
-1.00013e-007
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0
0
0
0
0
0
0
0
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(-9.99952e-005 -9.99952e-005 -9.99952e-005 -9.99951e-005 -9.99951e-005 -9.9995e-005 -9.99949e-005 -9.99946e-005 -9.99938e-005 -9.99907e-005);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(0.00011 0.00011 0.00011 0.00011 0.00011 0.00011 0.00011 0.00011 0.00011 0.00011);
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
